
    # 1.  Дано число. Выведите в консоль первую цифру этого числа.

# num = 9123421
# num= str(num)
# print(num[0])


    # 2.  Дано число. Выведите в консоль последнюю цифру этого числа.

# num = 9123421
# num= str(num)
# print(num[-1])

    # 3.  Дано число. Выведите в консоль сумму первой и последней цифры этого числа.

# num = 9123421
# num= str(num)
# sum = int(num[0])+int(num[-1])
# print(sum)


    # 4.  Дано число. Выведите количество цифр в этом числе.

# num = 9123421
# num= str(num)
# print(len(num))

    # 5.  Даны два числа. Проверьте, что первые цифры этих чисел совпадают.

# num1 = 47023
# num2 = 8334793
# num1,num2 = str(num1),  str(num2)
# if num1[0]==num2[0]:
#     print('yes')
# else:
#     print('no')

    # 6.  Дан список: [1, 2, 3, 4, 5, 6] Получите из него следующий срез: [1, 2, 3]

# nums = [1, 2, 3, 4, 5, 6]
# print(nums[0:3])