
    # 1.  Выведите в консоль все целые числа от 1 до 100.

# for i in range(1,101):
#     print(i, end=' ')


    # 2.  Выведите в консоль все целые числа от -100 до 0.

# for i in range(-100,1):
#     print(i, end=' ')


    # 3.  Выведите в консоль все целые числа от 100 до 1.

# for i in range(100,0,-1):
#     print(i, end=' ')


    # 4.  Выведите в консоль все четные числа из промежутка от 1 до 100.

# for num in range(1,101):
#     if num%2==0:
#         print(num, end=' ')


    # 5.  Выведите в консоль все числа кратные трем в промежутке от 1 до 100.

# for num in range(1,101):
#     if num%3==0:
#         print(num, end=' ')


    # 6. Дан список: [1, 2, 3, 4, 5, 6] Получите из него два последних элемента [5, 6]

# x =[1, 2, 3, 4, 5, 6]
# print(x[4:6])


    # 7.  Дана некоторая строка: 'abcdeabc' Получите сет ее символов: {'a', 'b', 'c', 'd', 'e'}

# str1 = 'abcdeabc'
# str1 = set(str1)
# print(str1)