    # 1.  Найдите сумму всех целых чисел от 1 до 100.

# c=0
# for i in range(1,101):
#     c+=i
#   
# print(c)


    # 2.  Найдите сумму всех целых четных чисел в промежутке от 1 до 100.

# c=0
# for i in range(1, 101):
#     if i%2==0:
#         c+=i

# print(c)


    # 3.  Найдите сумму всех целых нечетных чисел в промежутке от 1 до 100.

# c=0
# for i in range(1, 101):
#     if i%2!=0:
#         c+=i

# print(c)


    # 4.  Даны два целых числа. Найдите остаток от деления первого числа на второе.

# num1 = 143
# num2= 52
# result= num1%num2
# print(result)


    # 5.  Дан список: [1, 2, 3, 4, 5, 6] Получите из него каждый второй элемент: [1, 3, 5]

# nums = [1, 2, 3, 4, 5, 6]
# print(nums[0:7:2])