
    # 1.  Дан список с числами Найдите сумму элементов этого списка.

# sum = 0
# nums = [1, 2, 3, 4, 5]
# for num in nums:
#     sum = sum + num

# print(sum)


    # 2.  Дан список с числами Найдите сумму квадратов элементов этого списка.

# sum = 0
# nums = [1, 2, 3, 4, 5]
# for num in nums:
#     sum = sum + (num*num)

# print(sum)


    # 3.  Дан список с числами Найдите сумму квадратных корней элементов этого списка.

# from cmath import sqrt


# sum = 0
# nums = [1, 2, 3, 4, 5]
# for num in nums:
#     sum = sum + sqrt(num)

# print(sum)


    # 4.  Дан список с числами Найдите сумму положительных элементов этого списка.

# sum = 0
# nums = [1, 2, -3, 4, -5]
# for num in nums:
#     if num>0:
#         sum = sum + num
# print(sum)


    # 5.  Дан список с числами Найдите сумму тех элементов этого списка, которые больше нуля и меньше десяти.

# sum = 0
# nums = [-1, 2, -3, 4, 5, 11]
# for num in nums:
#     if num>0 and num<10:
#         sum = sum + num
# print(sum)


    # 6.  Дана некоторая строка Переберите и выведите в консоль по очереди все символы с конца строки.

# str1 = 'abcde'
# for item in str1[::-1]:
#     print(item, end='')