
    # 1.  Дана строка. Если в этой строке более одного символа, выведите в консоль предпоследний символ этой строки.

# x = 'qrijgipeq'
# if len(x)>1:
#     print(x[-2])


    # 2.  Даны два целых числа. Проверьте, что первое число без остатка делится на второе.

# num1 = 5
# num2 = 3
# if num1%num2==0:
#     print('yes')
# else:
#     print('no')


    # 3. Дана некоторая строка: 'abcde' Получите список ее символов: ['a', 'b', 'c', 'd', 'e']

# str1 = 'abcde'
# str1= list(str1)
# print(str1)


    # 4.  Дан список: [1, 2, 3, 4, 5, 6] Получите из него следующий срез: [3, 4, 5]
5
# nums = [1, 2, 3, 4, 5, 6]
# print(nums[2:5])


    # 5.  Из элементов словаря соберите дату в следующем формате: '2025-12-31'

# data = {
# 	'year' : '2025',
# 	'month': '12',
# 	'day'  : '31',
# }

# print(data['year'] + '-' + data['month'] + '-' + data['day'])
